; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v7 - type_3 ?v8 - type_1)
 	      (pred_2 ?v4 - object ?v8 - type_1)
	      (pred_4 ?v7 - type_3 ?v1 - type_2)
	      (pred_1 ?v7 - type_3 ?v4 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v7 - type_3 ?v2 ?v6 - type_1)
       :precondition (and  (pred_3 ?v7 ?v2))
       :effect (and  (pred_3 ?v7 ?v6)
		     (not (pred_3 ?v7 ?v2))))

   (:action op_3
       :parameters (?v7 - type_3 ?v5 - object ?v3 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v3) (pred_3 ?v7 ?v3) (pred_4 ?v7 ?v1))
       :effect (and (pred_1 ?v7 ?v5 ?v1)
		    (not (pred_2 ?v5 ?v3)) 
		    (not (pred_4 ?v7 ?v1))))

   (:action op_1
       :parameters (?v7 - type_3 ?v5 - object ?v3 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v5 ?v1) (pred_3 ?v7 ?v3))
       :effect (and (pred_2 ?v5 ?v3)
		    (pred_4 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v5 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_01 obj_08 - type_3
obj_10 obj_09 obj_12 obj_11 - type_2
obj_07 obj_02 obj_04 - type_1
obj_05 obj_03 obj_06 - object)
(:init
(pred_3 obj_01 obj_02)
(pred_4 obj_01 obj_10)
(pred_4 obj_01 obj_09)
(pred_3 obj_08 obj_02)
(pred_4 obj_08 obj_12)
(pred_4 obj_08 obj_11)
(pred_2 obj_05 obj_07)
(pred_2 obj_03 obj_07)
(pred_2 obj_06 obj_02)
)
(:goal
(and
(pred_2 obj_05 obj_02)
(pred_2 obj_03 obj_07)
(pred_2 obj_06 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_04)))
)
)

; plan
1. (op_3 obj_08 obj_06 obj_02 obj_11)
   deleted: (pred_2 obj_06 obj_02) (pred_4 obj_08 obj_11)
   added: (pred_1 obj_08 obj_06 obj_11)
   goals met: 1 of 3
2. (op_2 obj_01 obj_02 obj_07)
   deleted: (pred_3 obj_01 obj_02)
   added: (pred_3 obj_01 obj_07)
   goals met: 1 of 3
3. (op_2 obj_08 obj_02 obj_04)
   deleted: (pred_3 obj_08 obj_02)
   added: (pred_3 obj_08 obj_04)
   goals met: 1 of 3
4. (op_3 obj_01 obj_05 obj_07 obj_09)
   deleted: (pred_2 obj_05 obj_07) (pred_4 obj_01 obj_09)
   added: (pred_1 obj_01 obj_05 obj_09)
   goals met: 1 of 3
5. (op_1 obj_08 obj_06 obj_04 obj_11)
   deleted: (pred_1 obj_08 obj_06 obj_11)
   added: (pred_2 obj_06 obj_04) (pred_4 obj_08 obj_11)
   goals met: 2 of 3
6. (op_2 obj_01 obj_07 obj_02)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_02)
   goals met: 2 of 3
7. (op_1 obj_01 obj_05 obj_02 obj_09)
   deleted: (pred_1 obj_01 obj_05 obj_09)
   added: (pred_2 obj_05 obj_02) (pred_4 obj_01 obj_09)
   goals met: 3 of 3
